ConsultationMesures/C4/request.xml

<?xml version="1.0" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.enedis.fr/sge/b2b/services/consultermesures/v1.1" xmlns:tec="http://www.enedis.fr/sge/b2b/technique/v1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Header>
    <tec:entete>
      <version>1.1</version>
      <infoDemandeur>
        <loginDemandeur>sge-tiers@votre-entreprise.fr</loginDemandeur>
      </infoDemandeur>
    </tec:entete>
  </SOAP-ENV:Header>
  <ns0:Body>
    <ns1:consulterMesures>
      <pointId>30001642617347</pointId>
      <loginDemandeur>sge-tiers@votre-entreprise.fr</loginDemandeur>
      <contratId>2617347</contratId>
      <autorisationClient>true</autorisationClient>
    </ns1:consulterMesures>
  </ns0:Body>
</SOAP-ENV:Envelope>